In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
from datetime import datetime

import warnings
warnings.filterwarnings('ignore')

In [2]:
df_newco = pd.read_excel('./KPMG.xlsx', sheet_name='NewCustomerList',header=1)

In [3]:
df_newco.sample(6)

,first_name,last_name,gender,past_3_years_bike_related_purchases,DOB,job_title,job_industry_category,wealth_segment,deceased_indicator,owns_car,...,state,country,property_valuation,Unnamed: 16,Unnamed: 17,Unnamed: 18,Unnamed: 19,Unnamed: 20,Rank,Value
844,Maris,Leete,Female,21,1973-04-14,Engineer IV,Retail,Mass Customer,N,No,...,QLD,Australia,4,0.93,0.930,0.93000,0.790500,845,845,0.563125
643,Irvin,Bevans,Male,82,1962-07-12,Payment Adjustment Coordinator,Manufacturing,Mass Customer,N,No,...,NSW,Australia,11,0.95,0.950,1.18750,1.009375,644,644,0.730469
937,Jo,Roberts,Female,41,1945-10-31,Paralegal,Financial Services,High Net Worth,N,Yes,...,NSW,Australia,3,0.76,0.950,0.95000,0.950000,937,937,0.470000
790,Eachelle,Noirel,Female,93,1974-01-26,Registered Nurse,Health,Affluent Customer,N,Yes,...,NSW,Australia,6,0.46,0.575,0.71875,0.718750,791,791,0.612000
667,Essie,Withur,Female,42,1941-02-26,Director of Sales,Financial Services,High Net Worth,N,No,...,VIC,Australia,7,0.97,0.970,0.97000,0.970000,668,668,0.705500
42,Neile,Argent,Female,79,1946-10-25,NaN,Retail,Mass Customer,N,No,...,NSW,Australia,10,0.78,0.780,0.97500,0.828750,42,42,1.421875

In [4]:
df_newco.shape

(1000, 23)

In [5]:
df_newco.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 23 columns):
 #   Column                               Non-Null Count  Dtype
---  ------                               --------------  -----
 0   first_name                           1000 non-null   object
 1   last_name                            971 non-null    object
 2   gender                               1000 non-null   object
 3   past_3_years_bike_related_purchases  1000 non-null   int64
 4   DOB                                  983 non-null    datetime64[ns]
 5   job_title                            894 non-null    object
 6   job_industry_category                835 non-null    object
 7   wealth_segment                       1000 non-null   object
 8   deceased_indicator                   1000 non-null   object
 9   owns_car                             1000 non-null   object
 10  tenure                               1000 non-null   int64
 11  address                              1000 non-null   object
 12  postcode                             1000 non-null   int64
 13  state                                1000 non-null   object
 14  country                              1000 non-null   object
 15  property_valuation                   1000 non-null   int64
 16  Unnamed: 16                          1000 non-null   float64
 17  Unnamed: 17                          1000 non-null   float64
 18  Unnamed: 18                          1000 non-null   float64
 19  Unnamed: 19                          1000 non-null   float64
 20  Unnamed: 20                          1000 non-null   int64
 21  Rank                                 1000 non-null   int64
 22  Value                                1000 non-null   float64
dtypes: datetime64[ns](1), float64(5), int64(6), object(11)
memory usage: 179.8+ KB

In [6]:
df_newco.columns

Index(['first_name', 'last_name', 'gender',
       'past_3_years_bike_related_purchases', 'DOB', 'job_title',
       'job_industry_category', 'wealth_segment', 'deceased_indicator',
       'owns_car', 'tenure', 'address', 'postcode', 'state', 'country',
       'property_valuation', 'Unnamed: 16', 'Unnamed: 17', 'Unnamed: 18',
       'Unnamed: 19', 'Unnamed: 20', 'Rank', 'Value'],
      dtype='object')

In [7]:
df_newco.isna().sum()

first_name                               0
last_name                               29
gender                                   0
past_3_years_bike_related_purchases      0
DOB                                     17
job_title                              106
job_industry_category                  165
wealth_segment                           0
deceased_indicator                       0
owns_car                                 0
tenure                                   0
address                                  0
postcode                                 0
state                                    0
country                                  0
property_valuation                       0
Unnamed: 16                              0
Unnamed: 17                              0
Unnamed: 18                              0
Unnamed: 19                              0
Unnamed: 20                              0
Rank                                     0
Value                                    0
dtype: int64

In [8]:
df_newco.nunique()

first_name                              940
last_name                               961
gender                                    3
past_3_years_bike_related_purchases     100
DOB                                     958
job_title                               184
job_industry_category                     9
wealth_segment                            3
deceased_indicator                        1
owns_car                                  2
tenure                                   23
address                                1000
postcode                                522
state                                     3
country                                   1
property_valuation                       12
Unnamed: 16                              71
Unnamed: 17                             132
Unnamed: 18                             189
Unnamed: 19                             330
Unnamed: 20                             324
Rank                                    324
Value                                   324
dtype: int64

In [9]:
df_newco.gender.value_counts()

Female    513
Male      470
U          17
Name: gender, dtype: int64

In [10]:
df_newco.owns_car.value_counts()

No     507
Yes    493
Name: owns_car, dtype: int64

In [11]:
df_newco.state.value_counts()

NSW    506
VIC    266
QLD    228
Name: state, dtype: int64

In [12]:
df_newco.shape

(1000, 23)

In [13]:
# droping off unnamed columns

df_newco.drop([ 'Unnamed: 16', 'Unnamed: 17', 'Unnamed: 18','Unnamed: 19', 'Unnamed: 20'],axis=1, inplace = True)

In [14]:
df_newco.head()

,first_name,last_name,gender,past_3_years_bike_related_purchases,DOB,job_title,job_industry_category,wealth_segment,deceased_indicator,owns_car,tenure,address,postcode,state,country,property_valuation,Rank,Value
0,Chickie,Brister,Male,86,1957-07-12,General Manager,Manufacturing,Mass Customer,N,Yes,14,45 Shopko Center,4500,QLD,Australia,6,1,1.718750
1,Morly,Genery,Male,69,1970-03-22,Structural Engineer,Property,Mass Customer,N,No,16,14 Mccormick Park,2113,NSW,Australia,11,1,1.718750
2,Ardelis,Forrester,Female,10,1974-08-28,Senior Cost Accountant,Financial Services,Affluent Customer,N,No,10,5 Colorado Crossing,3505,VIC,Australia,5,1,1.718750
3,Lucine,Stutt,Female,64,1979-01-28,Account Representative III,Manufacturing,Affluent Customer,N,Yes,5,207 Annamark Plaza,4814,QLD,Australia,1,4,1.703125
4,Melinda,Hadlee,Female,34,1965-09-21,Financial Analyst,Financial Services,Affluent Customer,N,No,19,115 Montana Place,2093,NSW,Australia,9,4,1.703125

In [15]:
df_newco.shape

(1000, 18)

In [16]:
df_newco.Value = df_newco.Value.round(2)

In [17]:
df_newco.head()

,first_name,last_name,gender,past_3_years_bike_related_purchases,DOB,job_title,job_industry_category,wealth_segment,deceased_indicator,owns_car,tenure,address,postcode,state,country,property_valuation,Rank,Value
0,Chickie,Brister,Male,86,1957-07-12,General Manager,Manufacturing,Mass Customer,N,Yes,14,45 Shopko Center,4500,QLD,Australia,6,1,1.72
1,Morly,Genery,Male,69,1970-03-22,Structural Engineer,Property,Mass Customer,N,No,16,14 Mccormick Park,2113,NSW,Australia,11,1,1.72
2,Ardelis,Forrester,Female,10,1974-08-28,Senior Cost Accountant,Financial Services,Affluent Customer,N,No,10,5 Colorado Crossing,3505,VIC,Australia,5,1,1.72
3,Lucine,Stutt,Female,64,1979-01-28,Account Representative III,Manufacturing,Affluent Customer,N,Yes,5,207 Annamark Plaza,4814,QLD,Australia,1,4,1.70
4,Melinda,Hadlee,Female,34,1965-09-21,Financial Analyst,Financial Services,Affluent Customer,N,No,19,115 Montana Place,2093,NSW,Australia,9,4,1.70

In [18]:
df_newco.to_excel("KPMG_clean3.xlsx", sheet_name= 'NewCustomerList', index=False)

In [19]:
df = pd.read_excel('./KPMG_clean3.xlsx')
df.head()

,first_name,last_name,gender,past_3_years_bike_related_purchases,DOB,job_title,job_industry_category,wealth_segment,deceased_indicator,owns_car,tenure,address,postcode,state,country,property_valuation,Rank,Value
0,Chickie,Brister,Male,86,1957-07-12,General Manager,Manufacturing,Mass Customer,N,Yes,14,45 Shopko Center,4500,QLD,Australia,6,1,1.72
1,Morly,Genery,Male,69,1970-03-22,Structural Engineer,Property,Mass Customer,N,No,16,14 Mccormick Park,2113,NSW,Australia,11,1,1.72
2,Ardelis,Forrester,Female,10,1974-08-28,Senior Cost Accountant,Financial Services,Affluent Customer,N,No,10,5 Colorado Crossing,3505,VIC,Australia,5,1,1.72
3,Lucine,Stutt,Female,64,1979-01-28,Account Representative III,Manufacturing,Affluent Customer,N,Yes,5,207 Annamark Plaza,4814,QLD,Australia,1,4,1.70
4,Melinda,Hadlee,Female,34,1965-09-21,Financial Analyst,Financial Services,Affluent Customer,N,No,19,115 Montana Place,2093,NSW,Australia,9,4,1.70

In [20]:
df.shape

(1000, 18)

In [21]:
df.isna().sum()

first_name                               0
last_name                               29
gender                                   0
past_3_years_bike_related_purchases      0
DOB                                     17
job_title                              106
job_industry_category                  165
wealth_segment                           0
deceased_indicator                       0
owns_car                                 0
tenure                                   0
address                                  0
postcode                                 0
state                                    0
country                                  0
property_valuation                       0
Rank                                     0
Value                                    0
dtype: int64

In [22]:
df.dropna(inplace=True)

In [23]:
df.DOB.value_counts()

1987-01-15    2
1992-10-13    2
1941-07-21    2
1951-11-28    2
1959-09-18    2
             ..
1951-11-27    1
1939-12-22    1
1964-09-28    1
1961-02-11    1
1955-10-02    1
Name: DOB, Length: 702, dtype: int64

In [24]:
# Adding the new column Age after the DOB column
Age = ( datetime.now() - df.DOB).dt.days
df.insert(4,"Age",Age)
df['Age'] = (df['Age'] / 365.25).round()
df.Age = df.Age.astype(int)

In [25]:
df.drop("DOB", axis=1, inplace=True)

In [26]:
df.Age.value_counts().sort_index()

21     3
22     8
23    11
24    11
25    10
      ..
81     6
82     9
83     9
84     6
85     5
Name: Age, Length: 65, dtype: int64

In [27]:
age_bins = [20,30,40,50,60,70,80,90]
Age_category = pd.cut(df['Age'], bins = age_bins, right = True)
df.insert(5,'Age_category',Age_category)

In [49]:
df.wealth_segment.value_counts().sort_index()

Affluent Customer    173
High Net Worth       180
Mass Customer        362
Name: wealth_segment, dtype: int64

In [48]:
df.deceased_indicator.value_counts().sort_index()

N    715
Name: deceased_indicator, dtype: int64

In [50]:
df.owns_car.value_counts().sort_index()

No     366
Yes    349
Name: owns_car, dtype: int64

In [28]:
df1 = df.copy()

In [29]:
df1.head()

,first_name,last_name,gender,past_3_years_bike_related_purchases,Age,Age_category,job_title,job_industry_category,wealth_segment,deceased_indicator,owns_car,tenure,address,postcode,state,country,property_valuation,Rank,Value
0,Chickie,Brister,Male,86,66,"(60, 70]",General Manager,Manufacturing,Mass Customer,N,Yes,14,45 Shopko Center,4500,QLD,Australia,6,1,1.72
1,Morly,Genery,Male,69,53,"(50, 60]",Structural Engineer,Property,Mass Customer,N,No,16,14 Mccormick Park,2113,NSW,Australia,11,1,1.72
2,Ardelis,Forrester,Female,10,49,"(40, 50]",Senior Cost Accountant,Financial Services,Affluent Customer,N,No,10,5 Colorado Crossing,3505,VIC,Australia,5,1,1.72
3,Lucine,Stutt,Female,64,44,"(40, 50]",Account Representative III,Manufacturing,Affluent Customer,N,Yes,5,207 Annamark Plaza,4814,QLD,Australia,1,4,1.70
4,Melinda,Hadlee,Female,34,58,"(50, 60]",Financial Analyst,Financial Services,Affluent Customer,N,No,19,115 Montana Place,2093,NSW,Australia,9,4,1.70

In [55]:
df.to_excel("KPMG_cle.xlsx", sheet_name= 'NewCustomerList', index=False)